trade_exp/src/Documents/ОценкаСотрудника/ОценкаСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Document xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="31dad2e1-52ed-47e0-8e0c-ea66f9c6cc99">
  <name>ОценкаСотрудника</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes extendedConfigurationObject="3e4e02bd-ccf9-4fe3-9537-b410d239a264">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="028eb805-5562-48f7-b7ba-e77df0517f7c">
    <name>Автор</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="5a4403a3-3ccf-4461-9c91-4a6e6666ac26">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>500</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="512a2aa7-f75a-407b-b117-2843f292c050">
    <name>ШаблонОцениванияСотрудника</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="f0a47e44-59f5-4577-a40b-d97c6ae8d312">
    <name>ОценкиКомпетенций</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="9ecc3cfe-d803-4a2f-91b8-5360b52e9673">
      <name>Компетенция</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="84b74966-e7ea-4876-8356-d25e65842de7">
      <name>Значение</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Document>

trade_exp/src/InformationRegisters/ОценкиСотрудника/ОценкиСотрудника.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="bcb9a822-4158-47b6-8e06-a1fdd0c2365b">
  <name>ОценкиСотрудника</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="0013b3de-7f11-4b14-8af8-5622fb0ef5d1">
    <name>Значение</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>100</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </resources>
  <dimensions extendedConfigurationObject="59364816-378b-4752-945a-e4fa07ce1052">
    <name>Сотрудник</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
  <dimensions extendedConfigurationObject="aa7e1513-78c5-4aee-9999-8f877bcf82cc">
    <name>Компетенция</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Documents/ОценкаСотрудника/ObjectModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
	
&Вместо("ОбработкаПроведения")
Процедура ОбработкаПроведения(Отказ, Режим)
	Движения.ОценкиСотрудника.Записывать = Истина;
	Для Каждого Строка Из ОценкиКомпетенций Цикл
		Движение = Движения.ОценкиСотрудника.Добавить();
		Движение.Период = Дата;
		Движение.Сотрудник = Сотрудник;
		Движение.Компетенция = Строка.Компетенция;
		Движение.Значение = Строка.Значение;
	КонецЦикла;
КонецПроцедуры

#КонецЕсли
